from aiogram.types import KeyboardButton, ReplyKeyboardMarkup

def create_start_keyboard() -> list[list[KeyboardButton]]:
    """## Создание клавиатуры с главным функционалом бота:
    - Добавление подарков в свой список желаний;
    - Изменение данных своих подарков;
    - Удаление позиций из списка желаний;
    - Поделиться ссылкой на собственный список желаний;
    - Узнать пожелания другого человека по `username` или `id_telegram`

    :return: Возвращает объект клавиатуры с кнопками
    :rtype: list[list[KeyboardButton]]
    """
    keyboard = [
        [
            KeyboardButton(text="Добавить подарок 🎁")
        ],
        [
            KeyboardButton(text="Изменить 🧰"),
            KeyboardButton(text="Удалить 🗑")
        ],
        [
            KeyboardButton(text="Поделиться 📩"),
            KeyboardButton(text="Желания Человека 🤔")
        ]
    ]

    return keyboard

